docs/deploy/loadtest-local/reservation-none.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * rush: 20 looping VUs for 30s (gracefulStop: 30s)


Run    [ 100% ] setup()
rush   [   0% ]

Run    [ 100% ] setup()
rush   [   0% ]

Run    [ 100% ] setup()
rush   [   0% ]

running (0m04.0s), 20/20 VUs, 61 complete and 0 interrupted iterations
rush   [   1% ] 20 VUs  00.3s/30s

running (0m05.0s), 20/20 VUs, 345 complete and 0 interrupted iterations
rush   [   4% ] 20 VUs  01.3s/30s

running (0m06.0s), 20/20 VUs, 646 complete and 0 interrupted iterations
rush   [   8% ] 20 VUs  02.3s/30s

running (0m07.0s), 20/20 VUs, 1015 complete and 0 interrupted iterations
rush   [  11% ] 20 VUs  03.3s/30s

running (0m08.0s), 20/20 VUs, 1453 complete and 0 interrupted iterations
rush   [  14% ] 20 VUs  04.3s/30s

running (0m09.0s), 20/20 VUs, 1877 complete and 0 interrupted iterations
rush   [  18% ] 20 VUs  05.3s/30s

running (0m10.0s), 20/20 VUs, 2330 complete and 0 interrupted iterations
rush   [  21% ] 20 VUs  06.3s/30s

running (0m11.0s), 20/20 VUs, 2726 complete and 0 interrupted iterations
rush   [  24% ] 20 VUs  07.3s/30s

running (0m12.0s), 20/20 VUs, 3203 complete and 0 interrupted iterations
rush   [  28% ] 20 VUs  08.3s/30s

running (0m13.0s), 20/20 VUs, 3686 complete and 0 interrupted iterations
rush   [  31% ] 20 VUs  09.3s/30s

running (0m14.0s), 20/20 VUs, 4042 complete and 0 interrupted iterations
rush   [  34% ] 20 VUs  10.3s/30s

running (0m15.0s), 20/20 VUs, 4540 complete and 0 interrupted iterations
rush   [  38% ] 20 VUs  11.3s/30s

running (0m16.0s), 20/20 VUs, 5114 complete and 0 interrupted iterations
rush   [  41% ] 20 VUs  12.3s/30s

running (0m17.0s), 20/20 VUs, 5657 complete and 0 interrupted iterations
rush   [  44% ] 20 VUs  13.3s/30s

running (0m18.0s), 20/20 VUs, 6136 complete and 0 interrupted iterations
rush   [  48% ] 20 VUs  14.3s/30s

running (0m19.0s), 20/20 VUs, 6635 complete and 0 interrupted iterations
rush   [  51% ] 20 VUs  15.3s/30s

running (0m20.0s), 20/20 VUs, 7192 complete and 0 interrupted iterations
rush   [  54% ] 20 VUs  16.3s/30s

running (0m21.0s), 20/20 VUs, 7850 complete and 0 interrupted iterations
rush   [  58% ] 20 VUs  17.3s/30s

running (0m22.0s), 20/20 VUs, 8450 complete and 0 interrupted iterations
rush   [  61% ] 20 VUs  18.3s/30s

running (0m23.0s), 20/20 VUs, 9245 complete and 0 interrupted iterations
rush   [  64% ] 20 VUs  19.3s/30s

running (0m24.0s), 20/20 VUs, 10121 complete and 0 interrupted iterations
rush   [  68% ] 20 VUs  20.3s/30s

running (0m25.0s), 20/20 VUs, 10915 complete and 0 interrupted iterations
rush   [  71% ] 20 VUs  21.3s/30s

running (0m26.0s), 20/20 VUs, 11851 complete and 0 interrupted iterations
rush   [  74% ] 20 VUs  22.3s/30s

running (0m27.0s), 20/20 VUs, 12799 complete and 0 interrupted iterations
rush   [  78% ] 20 VUs  23.3s/30s

running (0m28.0s), 20/20 VUs, 13871 complete and 0 interrupted iterations
rush   [  81% ] 20 VUs  24.3s/30s

running (0m29.0s), 20/20 VUs, 14718 complete and 0 interrupted iterations
rush   [  84% ] 20 VUs  25.3s/30s

running (0m30.0s), 20/20 VUs, 15647 complete and 0 interrupted iterations
rush   [  88% ] 20 VUs  26.3s/30s

running (0m31.0s), 20/20 VUs, 16503 complete and 0 interrupted iterations
rush   [  91% ] 20 VUs  27.3s/30s

running (0m32.0s), 20/20 VUs, 17222 complete and 0 interrupted iterations
rush   [  94% ] 20 VUs  28.3s/30s

running (0m33.0s), 20/20 VUs, 17828 complete and 0 interrupted iterations
rush   [  98% ] 20 VUs  29.3s/30s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=62.78ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18447   547.702605/s
    checks_succeeded...: 100.00% 18447 out of 18447
    checks_failed......: 0.00%   0 out of 18447

    ✓ status is 201 or 409

    HTTP
    http_req_duration..............: avg=32.37ms min=7.38ms med=27.56ms max=369.32ms p(90)=52.49ms p(95)=62.78ms
      { expected_response:true }...: avg=32.37ms min=7.38ms med=27.56ms max=369.32ms p(90)=52.49ms p(95)=62.78ms
    http_req_failed................: 0.00%  0 out of 18487
    http_reqs......................: 18487  548.89023/s

    EXECUTION
    iteration_duration.............: avg=32.51ms min=7.48ms med=27.77ms max=369.54ms p(90)=52.53ms p(95)=62.65ms
    iterations.....................: 18447  547.702605/s
    vus............................: 20     min=0          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 9.2 MB 273 kB/s
    data_sent......................: 7.7 MB 228 kB/s



running (0m33.7s), 00/20 VUs, 18447 complete and 0 interrupted iterations
rush ✓ [ 100% ] 20 VUs  30s